{
  "documents": [
    { "id": 1, "text": "Before you can start shopping on ManageMed, you need to create an account. The registration process is quick and straightforward. When you first visit the application, look for the \"Create Account\" button on the welcome page. Click it to navigate to the registration form. You'll be asked to provide four pieces of information: your first name, your last name, a unique username that will identify your account, and a secure password. Your password is automatically encrypted using advanced security technology, so even if someone were to view the database, they couldn't read your actual password. Once you've filled in all the fields, click the \"Sign Up\" button. The system will create your account with a \"Customer\" role, which gives you access to all shopping features. If you already have an account, simply skip registration and go directly to the login page." },

    { "id": 2, "text": "To access your ManageMed account, go to the login page and enter the username and password you created during registration. The application uses a secure authentication system that verifies your credentials against your stored password. When you successfully log in, the system generates a unique security token that keeps you logged in for the next thirty minutes. This token is stored securely in a cookie that cannot be accessed by malicious scripts, protecting your account from common web attacks. Once logged in, you'll be taken to your personal dashboard where you can browse medicines, manage your cart, view your order history, and access other shopping features." },

    { "id": 3, "text": "After logging in, you'll land on Dashboard page where you can view all available pharmaceuticalsand and you can start shopping for medicines. The system displays medicines in an easy-to-read card layout where each medicine shows its name, the quantity currently in stock, the unit price, and a detailed description of what the medication is used for. If you're looking for a specific medicine rather than browsing the full catalog, use the search box at the top to find it by name. The search function will quickly filter the medicines and show only the ones matching your search term. This makes it easy to locate exactly what you need without having to scroll through hundreds of products." },

    { "id": 4, "text": "When you find a medicine you want to purchase, each product card displays an \"Add\" button to add it to the cart, typically represented by a shopping cart icon. Click this button to add the medicine to your cart. Once added, you'll see a success message confirming the addition." },

    { "id": 5, "text": "At any time before checkout, you can review or modify what you've added to your cart. Click the \"Menu\" button at the top and go to the \"View Cart\" page. Here you'll see a complete list of all the medicines you've selected, including the medicine name, the quantity for each item, and the unit price per medicine. You can also update the cart by choosing how many units of that medicine you want to purchase by selecting it from the dropdown. The system automatically calculates the total price for each item (quantity multiplied by unit price) and displays a grand total of all items combined. The page also automatically adds a shipping fee of fifty rupees to cover delivery costs, and this is added to your total. If for any reason you change your mind about a specific medicine, you can remove it from the cart by clicking the \"X\" button. Removing an item is immediate, and the cart totals will recalculate." },

    { "id": 6, "text": "Once you're satisfied with your cart contents and ready to purchase, click the \"Checkout\" button on the View Cart page. When you click this button, the system performs several important tasks behind the scenes. First, it reserves all the medicines in your cart from the pharmacy's inventory to ensure they're available for your order. The system checks that sufficient stock exists for each item and marks your items as \"RESERVED.\" If an item doesn't have enough stock available, the system notifies you of this issue and prevents checkout until you remove or reduce the quantity of that unavailable item. Once all items are successfully reserved, the system creates an order record associated with your account and generates a pending payment record." },

    { "id": 7, "text": "You'll then be redirected to a secure Stripe payment page, which is a trusted payment processor used by thousands of online businesses. This page operates on a secure, encrypted connection separate from ManageMed, protecting your payment information from the pharmacy's servers. On the Stripe page, you can enter your credit or debit card details, billing address, and other payment information. Stripe processes your payment and either approves or denies the transaction. If your payment is approved, you'll receive a success notification, your order status changes to \"Completed,\" and your shopping cart is cleared. You'll receive confirmation of your purchase. If your payment is declined or you choose to cancel the payment, no charges will be made to your card, the reserved medicines are returned to inventory, and you can return to shopping or try to check out again." },

    { "id": 8, "text": "As you shop, it's important to understand what happens with inventory. When you add a medicine to your cart, it's held in your shopping cart with a \"Pending\" status, which means the pharmacy hasn't yet reserved it from their stock. The medicine remains available for other customers to purchase. However, when you proceed to checkout, the system reserves all your items, which temporarily reduces the available quantity in the pharmacy's inventory. This reservation ensures that your medicines are held for you while you complete the payment process. If your payment succeeds, the reservation becomes permanent and your order is finalized. If your payment is cancelled or fails, the reserved quantity is immediately returned to available inventory so other customers can purchase it." },

    { "id": 9, "text": "After you've made purchases on ManageMed, you can view all your past orders at any time. Look for the \"My Orders\" option in your account menu or dashboard. Clicking this will take you to your order history page, which displays a list of all medicines you've previously purchased. For each order, you'll see the medicine name, the quantity you purchased, the price you paid, and the date you placed the order. This helps you keep track of what you've bought in the past, which can be useful if you regularly purchase the same medications and want to reorder them quickly." },

    { "id": 10, "text": "ManageMed includes an intelligent chatbot powered by artificial intelligence and RAG that can answer questions about how to use the application and its features which is proprietary information. Look for a chat icon button somewhere at the bottom of your screen, typically in the right corner. Click it to open the chat window. You can then type any question you have, such as \"How to create an account?\" or \"How to send a feedback?\" The chatbot will analyze your question and provide a helpful response based on its training data. The chatbot is available throughout your shopping experience and can help you make informed decisions about your purchases." },

    { "id": 11, "text": "ManageMed values your opinions and experiences as a customer. If you have suggestions for improvements, comments about your shopping experience, complaints about products or service, or general feedback about the application, you can submit this directly to the admin. Look for a \"Feedback\" option, usually found in the navigation menu or at the bottom of the page. Click on it to open a feedback form. Write your message explaining your feedback—whether it's positive feedback about what you liked or constructive suggestions for improvement. Once you've written your feedback, submit the form. Your message will be sent directly to the pharmacy administrator who will read it, consider your input, and potentially make changes based on customer feedback. This creates a direct communication channel between you and the pharmacy management." },

    { "id": 12, "text": "When you've finished shopping or using ManageMed, you should log out of your account. Look for a \"Logout\" button in the navigation menu. Clicking it will end your session, clear your authentication token, and return you to the welcome page. Your shopping cart will be preserved for your next login, so you don't have to add items again if you log out and return later. The browser is configured to prevent caching of authenticated pages, which means other people using the same computer cannot access your account by clicking the back button after you've logged out. This ensures that your account remains secure even if you use a shared or public computer." },

    { "id": 13, "text": "ManageMed is a user-friendly online pharmacy application that makes it simple and convenient to purchase medicines from your home. It's designed to help customers easily find the medications they need, add them to a shopping cart, securely pay for their orders, and track their purchase history. Whether you're looking for common over-the-counter medicines or prescription medications, ManageMed provides a straightforward platform to browse, search, and buy pharmaceuticals with confidence. The application also includes helpful features like an AI-powered chatbot that can answer questions about medicines and an option to provide feedback directly to the pharmacy to help improve the service." },

    { "id": 14, "text": "This application is created by Sayantika Pal, a Master of Science in Information Systems graduate. She is the admin and you can reach her for feedback or questions about the application at the email address pal.sayantika26@gmail.com. You can also follow her on LinkedIn at https://www.linkedin.com/in/sayantika-pal-729ab7125/" }

  ]
}
